# LightShape Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightShape Class
Members See Also
---
This class is the base class for specifying light shape.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class LightShape : IDisposable
```

Visual Basic
---
```text
Public Class LightShape _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LightShape : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightShape Autodesk.Revit.DB.Lighting..::..CircleLightShape Autodesk.Revit.DB.Lighting..::..LineLightShape Autodesk.Revit.DB.Lighting..::..PointLightShape Autodesk.Revit.DB.Lighting..::..RectangleLightShape
# See Also
LightShape Members
Autodesk.Revit.DB.Lighting Namespace